<?php

namespace App\Http\Controllers\SoftwareSettings;

use App\Helper\Helper;
use App\Http\Controllers\Controller;
use App\Models\Account;
use App\Models\Ataglance;
use App\Models\Branch;
use App\Models\Category;
use App\Models\Designation;
use App\Models\Event;
use App\Models\Exam;
use App\Models\FeesType;
use App\Models\Getintouch;
use App\Models\Group;
use App\Models\InsClass;
use App\Models\Menu;
use App\Models\News;
use App\Models\Notice;
use App\Models\Page;
use App\Models\Period;
use App\Models\Section;
use App\Models\Session;
use App\Models\Shift;
use App\Models\StockSms;
use App\Models\Student;
use App\Models\Subject;
use App\Models\SubjectType;
use App\Models\SubMarksDist;
use App\Models\SubMarksDistType;
use App\Models\Teacher;
use Illuminate\Http\Request;
use Illuminate\Support\Str;

class ImportDataController extends Controller
{
    public function index()
    {

        $modules = [
            'academic' => [
                'session'  => $this->dataCountByModel(Session::class),
                'class'    => $this->dataCountByModel(InsClass::class),
                'shift'    => $this->dataCountByModel(Shift::class),
                'section'  => $this->dataCountByModel(Session::class),
                'category' => $this->countCategory(),
                'group'    => $this->countGroup(),
                'student'  => $this->dataCountByModel(Student::class),
                'subject'  => $this->dataCountByModel(Subject::class),
                'period'  => $this->dataCountByModel(Period::class),
            ],
            'website' => [
                'menu'          => $this->dataCountByModel(Menu::class),
                'news'          => $this->dataCountByModel(News::class),
                'notice'        => $this->dataCountByModel(Notice::class),
                'at_a_glance'   => $this->dataCountByModel(Ataglance::class),
                'event'         => $this->dataCountByModel(Event::class),
                'get_in_touch'  => $this->dataCountByModel(Getintouch::class),
                'page'          => $this->dataCountByModel(Page::class),
            ],
            'teacher' => [
                'designation' => $this->dataCountByModel(Designation::class),
                'branch'      => $this->dataCountByModel(Branch::class),
                'teacher'     => $this->dataCountByModel(Teacher::class),
            ],
            'exam'   => [
                'exam'       => $this->dataCountByModel(Exam::class),
                'short_code' => $this->dataCountByModel(SubMarksDistType::class)
            ],
            'accounts' => [
                'account'    => $this->dataCountByModel(Account::class),
                'fees_type'  => $this->dataCountByModel(FeesType::class)
            ],
            'sms' => [
                'stock_sms'    => $this->dataCountByModel(StockSms::class)
            ]
        ];
        return view('template1.software-settings.import-data.index', compact('modules'));
    }

    public function import($module)
    {

        $method = $module . "DataImport";

        if (method_exists($this, $method)) {
            $this->$method();
        } else {
            $notification = array(
                'message' => "Method Not Exist",
                'alert-type' => 'error'
            );
            return redirect()->back()->with($notification);
        }

        //notification
        $notification = array(
            'message' => ucfirst($module) . ' Data Import Successfully ',
            'alert-type' => 'success'
        );
        return redirect()->back()->with($notification);
    }

    public function smsDataImport()
    {

        StockSms::updateOrCreate([
            'total_balance' => 0,
            'total_spend'   => 0,
            'currentBalance'=> 0,
            'alertBalance'  => 50,
        ]);
    }

    public function websiteDataImport()
    {

        News::UpdateOrCreate([
            'title' => 'Technology',
            'published_date' => '2022/12/19',
            'description' => 'High Time for Cyberlaw Enforcement and a Future of Work Strategy',
            'slug' => 'Technology',
            'image' => 'gal1.png',
            'status' => '1',

        ]);
        News::UpdateOrCreate([
            'title' => 'Hospital',
            'published_date' => '2022/12/19',
            'description' => 'Hospital management system is a computer system that helps manage the information related to health care and aids in the job completion of health care providers effectively.',
            'slug' => 'Hospital',
            'image' => 'gal2.png',
            'status' => '1',

        ]);

        //create notice

        Notice::create([
            'title'           => 'এসএসসি ও সমমান পরীক্ষা ২০২২ স্থগিত প্রসঙ্গে ',
            'published_date'  => date("Y-m-d"),
            'content'         => 'এসএসসি ও সমমান পরীক্ষা ২০২২ স্থগিত প্রসঙ্গে ',
            'slug'            => 'notice1',
            'status'          => '1',
        ]);

        Notice::create([
            'title'           => '6Sep সেপ্টেম্বর ২০২২ মাসের বেতন (পূর্বের বকেয়াসহ) পরিশোধ প্রসঙ্গে। ',
            'published_date'  => date("Y-m-d"),
            'content'         => '6Sep সেপ্টেম্বর ২০২২ মাসের বেতন (পূর্বের বকেয়াসহ) পরিশোধ প্রসঙ্গে। ',
            'slug'            => 'notice2',
            'status'          => '1',
        ]);
        Notice::create([
            'title'           => '১৯/১০/২০২২ তারিখে ১০ম-২০২২ শ্রেণির টেস্ট পরীক্ষা শুরু হবে।',
            'published_date'  => date("Y-m-d"),
            'content'         => '১৯/১০/২০২২ তারিখে ১০ম-২০২২ শ্রেণির টেস্ট পরীক্ষা শুরু হবে।',
            'slug'            => 'notice3',
            'status'          => '1',
        ]);

        //create at a glance seeder
        Ataglance::UpdateOrCreate([
            'content' => '<ul><li>প্রতিষ্ঠানের নাম: বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka)</li><li>প্রতিষ্ঠা: ১ মার্চ, ১৯৬০ (ইংরেজি মাধ্যম স্কুল হিসেবে)</li><li>শিক্ষা বোর্ডের স্বীকৃতি: ৩১ অক্টোবর, ১৯৬২</li><li>ইংরেজির পাশাপাশি বাংলা মাধ্যম চালু: ১ জানুয়ারি ১৯৬৭</li><li>শুধু বাংলা মাধ্যম চালু: ১ জানুয়ারি ১৯৭১</li><li>উচ্চমাধ্যমিক কলেজে উন্নীত: ১ জুলাই ১৯৭৭</li><li>বাংলার পাশাপাশি ইংরেজি মাধ্যম চালু: ১ জানুয়ারি ২০০৬</li><li>দ্বিতীয় শিফট চালু (১ম শ্রেণি পর্যন্ত): ১ জানুয়ারি ২০১৫</li><li>ডিগ্রি কলেজে উন্নীত: ১৯৯০-৯১ শিক্ষাবর্ষ</li><li>ডিগ্রি অবলুপ্ত: ২০০৬-২০০৭</li><li>স্কুলের স্বীকৃতি: ১ জুলাই ১৯৬২</li><li>কলেজের স্বীকৃতি: ১ জুলাই ১৯৭৮</li><li>স্কুল কোড: ১২৭২</li><li>কলেজ কোড: ১০৫১</li><li>EIIN: 500765</li></ul>'
        ]);

        //create event

        Event::create([
            'event_date'  => '13/06/2022',
            'title' => 'London Campus Visit - Postgraduate',
            'description'   => 'description',
            'image'  => 'event.png',
            'slug' => 'event',
            'status' => '1',
        ]);
        Event::create([
            'event_date'  => '13/06/2022',
            'title' => 'Technology',
            'description'   => 'High Time for Cyberlaw Enforcement and a Future of Work Strategy',
            'image'  => 'gal.png',
            'slug' => 'technology',
            'status' => '1',
        ]);

        //create getInTouch

        GetInTouch::updateOrCreate([
            'phone'  => '+8801407020100',
            'email'  => 'info@edtecobd.com',
            'address' => '2/4 Block G, 3rd Floor, Lalmatia, Dhaka-1207'
        ]);

        //create pages
        Page::updateOrCreate([
            'title'  => 'History',
            'slug' => 'history',
            'content' => '<p>বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ২০০৬ শিক্ষাবর্ষে জাতীয় শিক্ষাক্রম ও টেক্সটবুক বোর্ডের শিক্ষানীতি অনুযায়ী বাংলা মাধ্যমের পাশাপাশি ইংরেজি মাধ্যম চালু করা হয়। দীর্ঘ পাঁচ দশকেরও বেশি সময় ধরে প্রতিষ্ঠানটি বহু প্রতিভার জন্ম দিয়েছে যাঁরা জাতীয় ও আন্তর্জাতিক পর্যায়ে স্বনামধন্য হয়েছেন। গ্রুপ ক্যাপ্টেন ভোগার ছিলেন তৎকালীন পাকিস্তান বিমানবাহিনীর ঘাঁটি অফিসার-ইন-কমান্ড এবং একইসাথে সিভিল এভিয়েশনের ভারপ্রাপ্ত কর্মকর্তা। সেই সময় পাকিস্তান বিমানবাহিনী, সেনাবহিনী, সিভিল এভিয়েশন এবং PIA(Pakistan International Airlines) এর সকল কর্মকর্তা-কর্মচারী ছিলেন পশ্চিম পাকিস্তানী ও উর্দু ভাষাভাষী। তাই ঢাকায় বিমানবাহিনীর কর্মকর্তা-কর্মচারীবৃন্দের সন্তানদের শিক্ষা সমস্যা দূর করার লক্ষ্যে ইংরেজি মাধ্যম স্কুলের প্রয়োজনীয়তা সকলেই অনুভব করলেন। ফ্লাইট লেফটেন্যান্ট (শিক্ষা পরিদপ্তর) এজেএম খলিল উল্লাহ, যিনি পরবর্তীতে ইংল্যান্ডের লিংকন’স ইন হতে ব্যারিস্টার-এট-ল ডিগ্রি অর্জন করে ব্যারিস্টার খলিল উল্লাহ নামে অধিক সমাদৃত হন; স্কুলের প্রতিষ্ঠাতা সভাপতি হিসেবে নিয়োগ পান। স্কুল প্রতিষ্ঠার এই কাজটি ছিল অত্যান্ত সাহসী পদক্ষেপ। এই পর্যায়ে স্কুলটির একটি সার্থক নাম নিয়ে বিপদে পড়তে হয়। অবশেষে সার্জেন্ট জাকারিয়া এগিয়ে এলেন একটি উপযুক্ত নাম নিয়ে। তিনি শাহীন নামটির প্রস্তাব দিলেন এবং তা সাথে সাথে গ্রহণযোগ্যতা পেল। “শাহীন” একটি উর্দু শব্দ যার অর্থ হচ্ছে ঈগল, যা বিমানবাহিনীর সাথে অত্যান্ত সামঞ্জস্যপূর্ণ। স্কুল পরিচালনার অর্থ যোগান ও ভবন নির্মাণের বিষয়ে বিভিন্ন পরিকল্পনা, পর্যালোচনা চলল। আর এই সব পরিকল্পনা নিবেদিত প্রাণ ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলাউল্লাহ যোগ্য নেতৃত্বে বাস্তবে রূপ নিল। যদিও প্রাথমিকভাবে স্কুলটি বিমানবাহিনীর কর্মকর্তা-কর্মচারীদের সন্তানদের জন্য প্রতিষ্ঠা করা হয়েছিল; পরবর্তীতে তা বেসামরিক বিভিন্ন শ্রেণি-পেশার সন্তানদের জন্যও চালু করা হয়। এস. এ. আহমেদ ছিলেন স্কুলের প্রথম অধ্যক্ষ। স্কুলটি মাত্র ৩৪জন শিক্ষার্থী নিয়ে যাত্রা শুরু করে। স্কুল ভবন হিসেবে প্রথমে স্কোয়াশ কোর্ট ও পরবর্তীতে সার্জেন্ট মেস, ক্যাম্প মসজিদ ও রাডার ভবনকে ব্যবহার করা হয়। সিভিল এভিয়েশনের সম্প্রচার কক্ষকে অধ্যক্ষের কার্যালয় হিসেবে ব্যবহারের সুবিধা দেয়া হয়। ইতিমধ্যে প্রতিরক্ষা মন্ত্রণালয় বর্তমান স্কুল ভবনের জমিটি স্কুল কর্তৃপক্ষের জন্য বরাদ্দ দেয়। এভাবেই ১ মার্চ ১৯৬০ সালের এক সকালে গ্রুপ ক্যাপ্টেন ভোগার এবং ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলউল্লাহ যে ছোট্ট স্বপ্ন দেখেছিলেন তা আজ এক মাইলফলকে রূপান্তরিত হয়েছে। স্বাধীনতা পরবর্তী সময়ে বাংলাদেশ বিমানবাহিনী স্কুলটিকে নতুনভাবে গড়ে তোলেন। এদিকে ধীরে ধীরে ছাত্র-ছাত্রীর সংখ্যা বাড়তে থাকে।১৯৯৪-৯৮ সালের মধ্যে দু’টি তিনতলা কলেজ ভবন নির্মিত হয়। ২০০২-০৫ সালে নির্মিত হয় কলেজ অডিটোরিয়াম শাহীন হল। তাছাড়া নিরবিচ্ছিন্ন বিদ্যুৎ এবং পানি সরবরাহ নিশ্চিত করার লক্ষ্যে কলেজের নিজস্ব জেনারেটর এবং গভীর নলকূপ স্থাপন করা হয়েছে। এসকল অর্জন সম্ভব হয়েছে বিমানবাহিনী কর্তৃপক্ষের সুনিপুণ পরিকল্পনা ও দূরদৃষ্টির জন্য। ১৯৬০ সাল থেকে অদ্যবধি প্রতিষ্ঠানের জন্য অধ্যক্ষবৃন্দ, উপাধ্যক্ষবৃন্দ, শিক্ষক-শিক্ষিকা ও কর্মকর্তা-কর্মচারিগণের অবদান, ত্যাগ ও সহযোগিতা স্কুলের ইতিহাসে চিরভাস্কর হয়ে থাকবে।</p>',

        ]);
        Page::updateOrCreate([
            'title'  => 'Why Study',
            'slug' => 'whystudy',
            'content' => '<p>বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ২০০৬ শিক্ষাবর্ষে জাতীয় শিক্ষাক্রম ও টেক্সটবুক বোর্ডের শিক্ষানীতি অনুযায়ী বাংলা মাধ্যমের পাশাপাশি ইংরেজি মাধ্যম চালু করা হয়। দীর্ঘ পাঁচ দশকেরও বেশি সময় ধরে প্রতিষ্ঠানটি বহু প্রতিভার জন্ম দিয়েছে যাঁরা জাতীয় ও আন্তর্জাতিক পর্যায়ে স্বনামধন্য হয়েছেন। গ্রুপ ক্যাপ্টেন ভোগার ছিলেন তৎকালীন পাকিস্তান বিমানবাহিনীর ঘাঁটি অফিসার-ইন-কমান্ড এবং একইসাথে সিভিল এভিয়েশনের ভারপ্রাপ্ত কর্মকর্তা। সেই সময় পাকিস্তান বিমানবাহিনী, সেনাবহিনী, সিভিল এভিয়েশন এবং PIA(Pakistan International Airlines) এর সকল কর্মকর্তা-কর্মচারী ছিলেন পশ্চিম পাকিস্তানী ও উর্দু ভাষাভাষী। তাই ঢাকায় বিমানবাহিনীর কর্মকর্তা-কর্মচারীবৃন্দের সন্তানদের শিক্ষা সমস্যা দূর করার লক্ষ্যে ইংরেজি মাধ্যম স্কুলের প্রয়োজনীয়তা সকলেই অনুভব করলেন। ফ্লাইট লেফটেন্যান্ট (শিক্ষা পরিদপ্তর) এজেএম খলিল উল্লাহ, যিনি পরবর্তীতে ইংল্যান্ডের লিংকন’স ইন হতে ব্যারিস্টার-এট-ল ডিগ্রি অর্জন করে ব্যারিস্টার খলিল উল্লাহ নামে অধিক সমাদৃত হন; স্কুলের প্রতিষ্ঠাতা সভাপতি হিসেবে নিয়োগ পান। স্কুল প্রতিষ্ঠার এই কাজটি ছিল অত্যান্ত সাহসী পদক্ষেপ। এই পর্যায়ে স্কুলটির একটি সার্থক নাম নিয়ে বিপদে পড়তে হয়। অবশেষে সার্জেন্ট জাকারিয়া এগিয়ে এলেন একটি উপযুক্ত নাম নিয়ে। তিনি শাহীন নামটির প্রস্তাব দিলেন এবং তা সাথে সাথে গ্রহণযোগ্যতা পেল। “শাহীন” একটি উর্দু শব্দ যার অর্থ হচ্ছে ঈগল, যা বিমানবাহিনীর সাথে অত্যান্ত সামঞ্জস্যপূর্ণ। স্কুল পরিচালনার অর্থ যোগান ও ভবন নির্মাণের বিষয়ে বিভিন্ন পরিকল্পনা, পর্যালোচনা চলল। আর এই সব পরিকল্পনা নিবেদিত প্রাণ ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলাউল্লাহ যোগ্য নেতৃত্বে বাস্তবে রূপ নিল। যদিও প্রাথমিকভাবে স্কুলটি বিমানবাহিনীর কর্মকর্তা-কর্মচারীদের সন্তানদের জন্য প্রতিষ্ঠা করা হয়েছিল; পরবর্তীতে তা বেসামরিক বিভিন্ন শ্রেণি-পেশার সন্তানদের জন্যও চালু করা হয়। এস. এ. আহমেদ ছিলেন স্কুলের প্রথম অধ্যক্ষ। স্কুলটি মাত্র ৩৪জন শিক্ষার্থী নিয়ে যাত্রা শুরু করে। স্কুল ভবন হিসেবে প্রথমে স্কোয়াশ কোর্ট ও পরবর্তীতে সার্জেন্ট মেস, ক্যাম্প মসজিদ ও রাডার ভবনকে ব্যবহার করা হয়। সিভিল এভিয়েশনের সম্প্রচার কক্ষকে অধ্যক্ষের কার্যালয় হিসেবে ব্যবহারের সুবিধা দেয়া হয়। ইতিমধ্যে প্রতিরক্ষা মন্ত্রণালয় বর্তমান স্কুল ভবনের জমিটি স্কুল কর্তৃপক্ষের জন্য বরাদ্দ দেয়। এভাবেই ১ মার্চ ১৯৬০ সালের এক সকালে গ্রুপ ক্যাপ্টেন ভোগার এবং ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলউল্লাহ যে ছোট্ট স্বপ্ন দেখেছিলেন তা আজ এক মাইলফলকে রূপান্তরিত হয়েছে। স্বাধীনতা পরবর্তী সময়ে বাংলাদেশ বিমানবাহিনী স্কুলটিকে নতুনভাবে গড়ে তোলেন। এদিকে ধীরে ধীরে ছাত্র-ছাত্রীর সংখ্যা বাড়তে থাকে।১৯৯৪-৯৮ সালের মধ্যে দু’টি তিনতলা কলেজ ভবন নির্মিত হয়। ২০০২-০৫ সালে নির্মিত হয় কলেজ অডিটোরিয়াম শাহীন হল। তাছাড়া নিরবিচ্ছিন্ন বিদ্যুৎ এবং পানি সরবরাহ নিশ্চিত করার লক্ষ্যে কলেজের নিজস্ব জেনারেটর এবং গভীর নলকূপ স্থাপন করা হয়েছে। এসকল অর্জন সম্ভব হয়েছে বিমানবাহিনী কর্তৃপক্ষের সুনিপুণ পরিকল্পনা ও দূরদৃষ্টির জন্য। ১৯৬০ সাল থেকে অদ্যবধি প্রতিষ্ঠানের জন্য অধ্যক্ষবৃন্দ, উপাধ্যক্ষবৃন্দ, শিক্ষক-শিক্ষিকা ও কর্মকর্তা-কর্মচারিগণের অবদান, ত্যাগ ও সহযোগিতা স্কুলের ইতিহাসে চিরভাস্কর হয়ে থাকবে।</p>',

        ]);
        Page::updateOrCreate([
            'title'  => 'Infrastructure',
            'slug' => 'Infrastructure',
            'content' => '<ul><li>প্রতিষ্ঠানের নাম: বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka)</li><li>প্রতিষ্ঠা: ১ মার্চ, ১৯৬০ (ইংরেজি মাধ্যম স্কুল হিসেবে)</li><li>শিক্ষা বোর্ডের স্বীকৃতি: ৩১ অক্টোবর, ১৯৬২</li><li>ইংরেজির পাশাপাশি বাংলা মাধ্যম চালু: ১ জানুয়ারি ১৯৬৭</li><li>শুধু বাংলা মাধ্যম চালু: ১ জানুয়ারি ১৯৭১</li><li>উচ্চমাধ্যমিক কলেজে উন্নীত: ১ জুলাই ১৯৭৭</li><li>বাংলার পাশাপাশি ইংরেজি মাধ্যম চালু: ১ জানুয়ারি ২০০৬</li><li>দ্বিতীয় শিফট চালু (১ম শ্রেণি পর্যন্ত): ১ জানুয়ারি ২০১৫</li><li>ডিগ্রি কলেজে উন্নীত: ১৯৯০-৯১ শিক্ষাবর্ষ</li><li>ডিগ্রি অবলুপ্ত: ২০০৬-২০০৭</li><li>স্কুলের স্বীকৃতি: ১ জুলাই ১৯৬২</li><li>কলেজের স্বীকৃতি: ১ জুলাই ১৯৭৮</li><li>স্কুল কোড: ১২৭২</li><li>কলেজ কোড: ১০৫১</li><li>EIIN: 500765</li></ul>',

        ]);
        Page::updateOrCreate([
            'title'  => 'Achievement',
            'slug' => 'Achievement',
            'image' => 'gal1.png',
            'content' => '<p>বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ২০০৬ শিক্ষাবর্ষে জাতীয় শিক্ষাক্রম ও টেক্সটবুক বোর্ডের শিক্ষানীতি অনুযায়ী বাংলা মাধ্যমের পাশাপাশি ইংরেজি মাধ্যম চালু করা হয়। দীর্ঘ পাঁচ দশকেরও বেশি সময় ধরে প্রতিষ্ঠানটি বহু প্রতিভার জন্ম দিয়েছে যাঁরা জাতীয় ও আন্তর্জাতিক পর্যায়ে স্বনামধন্য হয়েছেন। গ্রুপ ক্যাপ্টেন ভোগার ছিলেন তৎকালীন পাকিস্তান বিমানবাহিনীর ঘাঁটি অফিসার-ইন-কমান্ড এবং একইসাথে সিভিল এভিয়েশনের ভারপ্রাপ্ত কর্মকর্তা। সেই সময় পাকিস্তান বিমানবাহিনী, সেনাবহিনী, সিভিল এভিয়েশন এবং PIA(Pakistan International Airlines) এর সকল কর্মকর্তা-কর্মচারী ছিলেন পশ্চিম পাকিস্তানী ও উর্দু ভাষাভাষী। তাই ঢাকায় বিমানবাহিনীর কর্মকর্তা-কর্মচারীবৃন্দের সন্তানদের শিক্ষা সমস্যা দূর করার লক্ষ্যে ইংরেজি মাধ্যম স্কুলের প্রয়োজনীয়তা সকলেই অনুভব করলেন। ফ্লাইট লেফটেন্যান্ট (শিক্ষা পরিদপ্তর) এজেএম খলিল উল্লাহ, যিনি পরবর্তীতে ইংল্যান্ডের লিংকন’স ইন হতে ব্যারিস্টার-এট-ল ডিগ্রি অর্জন করে ব্যারিস্টার খলিল উল্লাহ নামে অধিক সমাদৃত হন; স্কুলের প্রতিষ্ঠাতা সভাপতি হিসেবে নিয়োগ পান। স্কুল প্রতিষ্ঠার এই কাজটি ছিল অত্যান্ত সাহসী পদক্ষেপ। এই পর্যায়ে স্কুলটির একটি সার্থক নাম নিয়ে বিপদে পড়তে হয়। অবশেষে সার্জেন্ট জাকারিয়া এগিয়ে এলেন একটি উপযুক্ত নাম নিয়ে। তিনি শাহীন নামটির প্রস্তাব দিলেন এবং তা সাথে সাথে গ্রহণযোগ্যতা পেল। “শাহীন” একটি উর্দু শব্দ যার অর্থ হচ্ছে ঈগল, যা বিমানবাহিনীর সাথে অত্যান্ত সামঞ্জস্যপূর্ণ। স্কুল পরিচালনার অর্থ যোগান ও ভবন নির্মাণের বিষয়ে বিভিন্ন পরিকল্পনা, পর্যালোচনা চলল। আর এই সব পরিকল্পনা নিবেদিত প্রাণ ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলাউল্লাহ যোগ্য নেতৃত্বে বাস্তবে রূপ নিল। যদিও প্রাথমিকভাবে স্কুলটি বিমানবাহিনীর কর্মকর্তা-কর্মচারীদের সন্তানদের জন্য প্রতিষ্ঠা করা হয়েছিল; পরবর্তীতে তা বেসামরিক বিভিন্ন শ্রেণি-পেশার সন্তানদের জন্যও চালু করা হয়। এস. এ. আহমেদ ছিলেন স্কুলের প্রথম অধ্যক্ষ। স্কুলটি মাত্র ৩৪জন শিক্ষার্থী নিয়ে যাত্রা শুরু করে। স্কুল ভবন হিসেবে প্রথমে স্কোয়াশ কোর্ট ও পরবর্তীতে সার্জেন্ট মেস, ক্যাম্প মসজিদ ও রাডার ভবনকে ব্যবহার করা হয়। সিভিল এভিয়েশনের সম্প্রচার কক্ষকে অধ্যক্ষের কার্যালয় হিসেবে ব্যবহারের সুবিধা দেয়া হয়। ইতিমধ্যে প্রতিরক্ষা মন্ত্রণালয় বর্তমান স্কুল ভবনের জমিটি স্কুল কর্তৃপক্ষের জন্য বরাদ্দ দেয়। এভাবেই ১ মার্চ ১৯৬০ সালের এক সকালে গ্রুপ ক্যাপ্টেন ভোগার এবং ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলউল্লাহ যে ছোট্ট স্বপ্ন দেখেছিলেন তা আজ এক মাইলফলকে রূপান্তরিত হয়েছে। স্বাধীনতা পরবর্তী সময়ে বাংলাদেশ বিমানবাহিনী স্কুলটিকে নতুনভাবে গড়ে তোলেন। এদিকে ধীরে ধীরে ছাত্র-ছাত্রীর সংখ্যা বাড়তে থাকে।১৯৯৪-৯৮ সালের মধ্যে দু’টি তিনতলা কলেজ ভবন নির্মিত হয়। ২০০২-০৫ সালে নির্মিত হয় কলেজ অডিটোরিয়াম শাহীন হল। তাছাড়া নিরবিচ্ছিন্ন বিদ্যুৎ এবং পানি সরবরাহ নিশ্চিত করার লক্ষ্যে কলেজের নিজস্ব জেনারেটর এবং গভীর নলকূপ স্থাপন করা হয়েছে। এসকল অর্জন সম্ভব হয়েছে বিমানবাহিনী কর্তৃপক্ষের সুনিপুণ পরিকল্পনা ও দূরদৃষ্টির জন্য। ১৯৬০ সাল থেকে অদ্যবধি প্রতিষ্ঠানের জন্য অধ্যক্ষবৃন্দ, উপাধ্যক্ষবৃন্দ, শিক্ষক-শিক্ষিকা ও কর্মকর্তা-কর্মচারিগণের অবদান, ত্যাগ ও সহযোগিতা স্কুলের ইতিহাসে চিরভাস্কর হয়ে থাকবে।</p>',

        ]);
        Page::updateOrCreate([
            'title'  => 'News & Event',
            'slug' => 'Newsevent',
            'image' => 'gal1.png',
            'content' => '<p>বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ২০০৬ শিক্ষাবর্ষে জাতীয় শিক্ষাক্রম ও টেক্সটবুক বোর্ডের শিক্ষানীতি অনুযায়ী বাংলা মাধ্যমের পাশাপাশি ইংরেজি মাধ্যম চালু করা হয়। দীর্ঘ পাঁচ দশকেরও বেশি সময় ধরে প্রতিষ্ঠানটি বহু প্রতিভার জন্ম দিয়েছে যাঁরা জাতীয় ও আন্তর্জাতিক পর্যায়ে স্বনামধন্য হয়েছেন। গ্রুপ ক্যাপ্টেন ভোগার ছিলেন তৎকালীন পাকিস্তান বিমানবাহিনীর ঘাঁটি অফিসার-ইন-কমান্ড এবং একইসাথে সিভিল এভিয়েশনের ভারপ্রাপ্ত কর্মকর্তা। সেই সময় পাকিস্তান বিমানবাহিনী, সেনাবহিনী, সিভিল এভিয়েশন এবং PIA(Pakistan International Airlines) এর সকল কর্মকর্তা-কর্মচারী ছিলেন পশ্চিম পাকিস্তানী ও উর্দু ভাষাভাষী। তাই ঢাকায় বিমানবাহিনীর কর্মকর্তা-কর্মচারীবৃন্দের সন্তানদের শিক্ষা সমস্যা দূর করার লক্ষ্যে ইংরেজি মাধ্যম স্কুলের প্রয়োজনীয়তা সকলেই অনুভব করলেন। ফ্লাইট লেফটেন্যান্ট (শিক্ষা পরিদপ্তর) এজেএম খলিল উল্লাহ, যিনি পরবর্তীতে ইংল্যান্ডের লিংকন’স ইন হতে ব্যারিস্টার-এট-ল ডিগ্রি অর্জন করে ব্যারিস্টার খলিল উল্লাহ নামে অধিক সমাদৃত হন; স্কুলের প্রতিষ্ঠাতা সভাপতি হিসেবে নিয়োগ পান। স্কুল প্রতিষ্ঠার এই কাজটি ছিল অত্যান্ত সাহসী পদক্ষেপ। এই পর্যায়ে স্কুলটির একটি সার্থক নাম নিয়ে বিপদে পড়তে হয়। অবশেষে সার্জেন্ট জাকারিয়া এগিয়ে এলেন একটি উপযুক্ত নাম নিয়ে। তিনি শাহীন নামটির প্রস্তাব দিলেন এবং তা সাথে সাথে গ্রহণযোগ্যতা পেল। “শাহীন” একটি উর্দু শব্দ যার অর্থ হচ্ছে ঈগল, যা বিমানবাহিনীর সাথে অত্যান্ত সামঞ্জস্যপূর্ণ। স্কুল পরিচালনার অর্থ যোগান ও ভবন নির্মাণের বিষয়ে বিভিন্ন পরিকল্পনা, পর্যালোচনা চলল। আর এই সব পরিকল্পনা নিবেদিত প্রাণ ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলাউল্লাহ যোগ্য নেতৃত্বে বাস্তবে রূপ নিল। যদিও প্রাথমিকভাবে স্কুলটি বিমানবাহিনীর কর্মকর্তা-কর্মচারীদের সন্তানদের জন্য প্রতিষ্ঠা করা হয়েছিল; পরবর্তীতে তা বেসামরিক বিভিন্ন শ্রেণি-পেশার সন্তানদের জন্যও চালু করা হয়। এস. এ. আহমেদ ছিলেন স্কুলের প্রথম অধ্যক্ষ। স্কুলটি মাত্র ৩৪জন শিক্ষার্থী নিয়ে যাত্রা শুরু করে। স্কুল ভবন হিসেবে প্রথমে স্কোয়াশ কোর্ট ও পরবর্তীতে সার্জেন্ট মেস, ক্যাম্প মসজিদ ও রাডার ভবনকে ব্যবহার করা হয়। সিভিল এভিয়েশনের সম্প্রচার কক্ষকে অধ্যক্ষের কার্যালয় হিসেবে ব্যবহারের সুবিধা দেয়া হয়। ইতিমধ্যে প্রতিরক্ষা মন্ত্রণালয় বর্তমান স্কুল ভবনের জমিটি স্কুল কর্তৃপক্ষের জন্য বরাদ্দ দেয়। এভাবেই ১ মার্চ ১৯৬০ সালের এক সকালে গ্রুপ ক্যাপ্টেন ভোগার এবং ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলউল্লাহ যে ছোট্ট স্বপ্ন দেখেছিলেন তা আজ এক মাইলফলকে রূপান্তরিত হয়েছে। স্বাধীনতা পরবর্তী সময়ে বাংলাদেশ বিমানবাহিনী স্কুলটিকে নতুনভাবে গড়ে তোলেন। এদিকে ধীরে ধীরে ছাত্র-ছাত্রীর সংখ্যা বাড়তে থাকে।১৯৯৪-৯৮ সালের মধ্যে দু’টি তিনতলা কলেজ ভবন নির্মিত হয়। ২০০২-০৫ সালে নির্মিত হয় কলেজ অডিটোরিয়াম শাহীন হল। তাছাড়া নিরবিচ্ছিন্ন বিদ্যুৎ এবং পানি সরবরাহ নিশ্চিত করার লক্ষ্যে কলেজের নিজস্ব জেনারেটর এবং গভীর নলকূপ স্থাপন করা হয়েছে। এসকল অর্জন সম্ভব হয়েছে বিমানবাহিনী কর্তৃপক্ষের সুনিপুণ পরিকল্পনা ও দূরদৃষ্টির জন্য। ১৯৬০ সাল থেকে অদ্যবধি প্রতিষ্ঠানের জন্য অধ্যক্ষবৃন্দ, উপাধ্যক্ষবৃন্দ, শিক্ষক-শিক্ষিকা ও কর্মকর্তা-কর্মচারিগণের অবদান, ত্যাগ ও সহযোগিতা স্কুলের ইতিহাসে চিরভাস্কর হয়ে থাকবে।</p>',

        ]);
        Page::updateOrCreate([
            'title'  => 'Sports',
            'slug' => 'sports',
            'image' => 'gal1.png',
            'content' => '<p>বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ২০০৬ শিক্ষাবর্ষে জাতীয় শিক্ষাক্রম ও টেক্সটবুক বোর্ডের শিক্ষানীতি অনুযায়ী বাংলা মাধ্যমের পাশাপাশি ইংরেজি মাধ্যম চালু করা হয়। দীর্ঘ পাঁচ দশকেরও বেশি সময় ধরে প্রতিষ্ঠানটি বহু প্রতিভার জন্ম দিয়েছে যাঁরা জাতীয় ও আন্তর্জাতিক পর্যায়ে স্বনামধন্য হয়েছেন। গ্রুপ ক্যাপ্টেন ভোগার ছিলেন তৎকালীন পাকিস্তান বিমানবাহিনীর ঘাঁটি অফিসার-ইন-কমান্ড এবং একইসাথে সিভিল এভিয়েশনের ভারপ্রাপ্ত কর্মকর্তা। সেই সময় পাকিস্তান বিমানবাহিনী, সেনাবহিনী, সিভিল এভিয়েশন এবং PIA(Pakistan International Airlines) এর সকল কর্মকর্তা-কর্মচারী ছিলেন পশ্চিম পাকিস্তানী ও উর্দু ভাষাভাষী। তাই ঢাকায় বিমানবাহিনীর কর্মকর্তা-কর্মচারীবৃন্দের সন্তানদের শিক্ষা সমস্যা দূর করার লক্ষ্যে ইংরেজি মাধ্যম স্কুলের প্রয়োজনীয়তা সকলেই অনুভব করলেন। ফ্লাইট লেফটেন্যান্ট (শিক্ষা পরিদপ্তর) এজেএম খলিল উল্লাহ, যিনি পরবর্তীতে ইংল্যান্ডের লিংকন’স ইন হতে ব্যারিস্টার-এট-ল ডিগ্রি অর্জন করে ব্যারিস্টার খলিল উল্লাহ নামে অধিক সমাদৃত হন; স্কুলের প্রতিষ্ঠাতা সভাপতি হিসেবে নিয়োগ পান। স্কুল প্রতিষ্ঠার এই কাজটি ছিল অত্যান্ত সাহসী পদক্ষেপ। এই পর্যায়ে স্কুলটির একটি সার্থক নাম নিয়ে বিপদে পড়তে হয়। অবশেষে সার্জেন্ট জাকারিয়া এগিয়ে এলেন একটি উপযুক্ত নাম নিয়ে। তিনি শাহীন নামটির প্রস্তাব দিলেন এবং তা সাথে সাথে গ্রহণযোগ্যতা পেল। “শাহীন” একটি উর্দু শব্দ যার অর্থ হচ্ছে ঈগল, যা বিমানবাহিনীর সাথে অত্যান্ত সামঞ্জস্যপূর্ণ। স্কুল পরিচালনার অর্থ যোগান ও ভবন নির্মাণের বিষয়ে বিভিন্ন পরিকল্পনা, পর্যালোচনা চলল। আর এই সব পরিকল্পনা নিবেদিত প্রাণ ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলাউল্লাহ যোগ্য নেতৃত্বে বাস্তবে রূপ নিল। যদিও প্রাথমিকভাবে স্কুলটি বিমানবাহিনীর কর্মকর্তা-কর্মচারীদের সন্তানদের জন্য প্রতিষ্ঠা করা হয়েছিল; পরবর্তীতে তা বেসামরিক বিভিন্ন শ্রেণি-পেশার সন্তানদের জন্যও চালু করা হয়। এস. এ. আহমেদ ছিলেন স্কুলের প্রথম অধ্যক্ষ। স্কুলটি মাত্র ৩৪জন শিক্ষার্থী নিয়ে যাত্রা শুরু করে। স্কুল ভবন হিসেবে প্রথমে স্কোয়াশ কোর্ট ও পরবর্তীতে সার্জেন্ট মেস, ক্যাম্প মসজিদ ও রাডার ভবনকে ব্যবহার করা হয়। সিভিল এভিয়েশনের সম্প্রচার কক্ষকে অধ্যক্ষের কার্যালয় হিসেবে ব্যবহারের সুবিধা দেয়া হয়। ইতিমধ্যে প্রতিরক্ষা মন্ত্রণালয় বর্তমান স্কুল ভবনের জমিটি স্কুল কর্তৃপক্ষের জন্য বরাদ্দ দেয়। এভাবেই ১ মার্চ ১৯৬০ সালের এক সকালে গ্রুপ ক্যাপ্টেন ভোগার এবং ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলউল্লাহ যে ছোট্ট স্বপ্ন দেখেছিলেন তা আজ এক মাইলফলকে রূপান্তরিত হয়েছে। স্বাধীনতা পরবর্তী সময়ে বাংলাদেশ বিমানবাহিনী স্কুলটিকে নতুনভাবে গড়ে তোলেন। এদিকে ধীরে ধীরে ছাত্র-ছাত্রীর সংখ্যা বাড়তে থাকে।১৯৯৪-৯৮ সালের মধ্যে দু’টি তিনতলা কলেজ ভবন নির্মিত হয়। ২০০২-০৫ সালে নির্মিত হয় কলেজ অডিটোরিয়াম শাহীন হল। তাছাড়া নিরবিচ্ছিন্ন বিদ্যুৎ এবং পানি সরবরাহ নিশ্চিত করার লক্ষ্যে কলেজের নিজস্ব জেনারেটর এবং গভীর নলকূপ স্থাপন করা হয়েছে। এসকল অর্জন সম্ভব হয়েছে বিমানবাহিনী কর্তৃপক্ষের সুনিপুণ পরিকল্পনা ও দূরদৃষ্টির জন্য। ১৯৬০ সাল থেকে অদ্যবধি প্রতিষ্ঠানের জন্য অধ্যক্ষবৃন্দ, উপাধ্যক্ষবৃন্দ, শিক্ষক-শিক্ষিকা ও কর্মকর্তা-কর্মচারিগণের অবদান, ত্যাগ ও সহযোগিতা স্কুলের ইতিহাসে চিরভাস্কর হয়ে থাকবে।</p>',

        ]);
        Page::updateOrCreate([
            'title'  => 'Tours',
            'slug' => 'tours',
            'image' => 'gal1.png',
            'content' => '<p>বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ২০০৬ শিক্ষাবর্ষে জাতীয় শিক্ষাক্রম ও টেক্সটবুক বোর্ডের শিক্ষানীতি অনুযায়ী বাংলা মাধ্যমের পাশাপাশি ইংরেজি মাধ্যম চালু করা হয়। দীর্ঘ পাঁচ দশকেরও বেশি সময় ধরে প্রতিষ্ঠানটি বহু প্রতিভার জন্ম দিয়েছে যাঁরা জাতীয় ও আন্তর্জাতিক পর্যায়ে স্বনামধন্য হয়েছেন। গ্রুপ ক্যাপ্টেন ভোগার ছিলেন তৎকালীন পাকিস্তান বিমানবাহিনীর ঘাঁটি অফিসার-ইন-কমান্ড এবং একইসাথে সিভিল এভিয়েশনের ভারপ্রাপ্ত কর্মকর্তা। সেই সময় পাকিস্তান বিমানবাহিনী, সেনাবহিনী, সিভিল এভিয়েশন এবং PIA(Pakistan International Airlines) এর সকল কর্মকর্তা-কর্মচারী ছিলেন পশ্চিম পাকিস্তানী ও উর্দু ভাষাভাষী। তাই ঢাকায় বিমানবাহিনীর কর্মকর্তা-কর্মচারীবৃন্দের সন্তানদের শিক্ষা সমস্যা দূর করার লক্ষ্যে ইংরেজি মাধ্যম স্কুলের প্রয়োজনীয়তা সকলেই অনুভব করলেন। ফ্লাইট লেফটেন্যান্ট (শিক্ষা পরিদপ্তর) এজেএম খলিল উল্লাহ, যিনি পরবর্তীতে ইংল্যান্ডের লিংকন’স ইন হতে ব্যারিস্টার-এট-ল ডিগ্রি অর্জন করে ব্যারিস্টার খলিল উল্লাহ নামে অধিক সমাদৃত হন; স্কুলের প্রতিষ্ঠাতা সভাপতি হিসেবে নিয়োগ পান। স্কুল প্রতিষ্ঠার এই কাজটি ছিল অত্যান্ত সাহসী পদক্ষেপ। এই পর্যায়ে স্কুলটির একটি সার্থক নাম নিয়ে বিপদে পড়তে হয়। অবশেষে সার্জেন্ট জাকারিয়া এগিয়ে এলেন একটি উপযুক্ত নাম নিয়ে। তিনি শাহীন নামটির প্রস্তাব দিলেন এবং তা সাথে সাথে গ্রহণযোগ্যতা পেল। “শাহীন” একটি উর্দু শব্দ যার অর্থ হচ্ছে ঈগল, যা বিমানবাহিনীর সাথে অত্যান্ত সামঞ্জস্যপূর্ণ। স্কুল পরিচালনার অর্থ যোগান ও ভবন নির্মাণের বিষয়ে বিভিন্ন পরিকল্পনা, পর্যালোচনা চলল। আর এই সব পরিকল্পনা নিবেদিত প্রাণ ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলাউল্লাহ যোগ্য নেতৃত্বে বাস্তবে রূপ নিল। যদিও প্রাথমিকভাবে স্কুলটি বিমানবাহিনীর কর্মকর্তা-কর্মচারীদের সন্তানদের জন্য প্রতিষ্ঠা করা হয়েছিল; পরবর্তীতে তা বেসামরিক বিভিন্ন শ্রেণি-পেশার সন্তানদের জন্যও চালু করা হয়। এস. এ. আহমেদ ছিলেন স্কুলের প্রথম অধ্যক্ষ। স্কুলটি মাত্র ৩৪জন শিক্ষার্থী নিয়ে যাত্রা শুরু করে। স্কুল ভবন হিসেবে প্রথমে স্কোয়াশ কোর্ট ও পরবর্তীতে সার্জেন্ট মেস, ক্যাম্প মসজিদ ও রাডার ভবনকে ব্যবহার করা হয়। সিভিল এভিয়েশনের সম্প্রচার কক্ষকে অধ্যক্ষের কার্যালয় হিসেবে ব্যবহারের সুবিধা দেয়া হয়। ইতিমধ্যে প্রতিরক্ষা মন্ত্রণালয় বর্তমান স্কুল ভবনের জমিটি স্কুল কর্তৃপক্ষের জন্য বরাদ্দ দেয়। এভাবেই ১ মার্চ ১৯৬০ সালের এক সকালে গ্রুপ ক্যাপ্টেন ভোগার এবং ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলউল্লাহ যে ছোট্ট স্বপ্ন দেখেছিলেন তা আজ এক মাইলফলকে রূপান্তরিত হয়েছে। স্বাধীনতা পরবর্তী সময়ে বাংলাদেশ বিমানবাহিনী স্কুলটিকে নতুনভাবে গড়ে তোলেন। এদিকে ধীরে ধীরে ছাত্র-ছাত্রীর সংখ্যা বাড়তে থাকে।১৯৯৪-৯৮ সালের মধ্যে দু’টি তিনতলা কলেজ ভবন নির্মিত হয়। ২০০২-০৫ সালে নির্মিত হয় কলেজ অডিটোরিয়াম শাহীন হল। তাছাড়া নিরবিচ্ছিন্ন বিদ্যুৎ এবং পানি সরবরাহ নিশ্চিত করার লক্ষ্যে কলেজের নিজস্ব জেনারেটর এবং গভীর নলকূপ স্থাপন করা হয়েছে। এসকল অর্জন সম্ভব হয়েছে বিমানবাহিনী কর্তৃপক্ষের সুনিপুণ পরিকল্পনা ও দূরদৃষ্টির জন্য। ১৯৬০ সাল থেকে অদ্যবধি প্রতিষ্ঠানের জন্য অধ্যক্ষবৃন্দ, উপাধ্যক্ষবৃন্দ, শিক্ষক-শিক্ষিকা ও কর্মকর্তা-কর্মচারিগণের অবদান, ত্যাগ ও সহযোগিতা স্কুলের ইতিহাসে চিরভাস্কর হয়ে থাকবে।</p>',

        ]);
        Page::updateOrCreate([
            'title'  => 'Scout',
            'slug' => 'scout',
            'image' => 'gal1.png',
            'content' => '<p>বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ২০০৬ শিক্ষাবর্ষে জাতীয় শিক্ষাক্রম ও টেক্সটবুক বোর্ডের শিক্ষানীতি অনুযায়ী বাংলা মাধ্যমের পাশাপাশি ইংরেজি মাধ্যম চালু করা হয়। দীর্ঘ পাঁচ দশকেরও বেশি সময় ধরে প্রতিষ্ঠানটি বহু প্রতিভার জন্ম দিয়েছে যাঁরা জাতীয় ও আন্তর্জাতিক পর্যায়ে স্বনামধন্য হয়েছেন। গ্রুপ ক্যাপ্টেন ভোগার ছিলেন তৎকালীন পাকিস্তান বিমানবাহিনীর ঘাঁটি অফিসার-ইন-কমান্ড এবং একইসাথে সিভিল এভিয়েশনের ভারপ্রাপ্ত কর্মকর্তা। সেই সময় পাকিস্তান বিমানবাহিনী, সেনাবহিনী, সিভিল এভিয়েশন এবং PIA(Pakistan International Airlines) এর সকল কর্মকর্তা-কর্মচারী ছিলেন পশ্চিম পাকিস্তানী ও উর্দু ভাষাভাষী। তাই ঢাকায় বিমানবাহিনীর কর্মকর্তা-কর্মচারীবৃন্দের সন্তানদের শিক্ষা সমস্যা দূর করার লক্ষ্যে ইংরেজি মাধ্যম স্কুলের প্রয়োজনীয়তা সকলেই অনুভব করলেন। ফ্লাইট লেফটেন্যান্ট (শিক্ষা পরিদপ্তর) এজেএম খলিল উল্লাহ, যিনি পরবর্তীতে ইংল্যান্ডের লিংকন’স ইন হতে ব্যারিস্টার-এট-ল ডিগ্রি অর্জন করে ব্যারিস্টার খলিল উল্লাহ নামে অধিক সমাদৃত হন; স্কুলের প্রতিষ্ঠাতা সভাপতি হিসেবে নিয়োগ পান। স্কুল প্রতিষ্ঠার এই কাজটি ছিল অত্যান্ত সাহসী পদক্ষেপ। এই পর্যায়ে স্কুলটির একটি সার্থক নাম নিয়ে বিপদে পড়তে হয়। অবশেষে সার্জেন্ট জাকারিয়া এগিয়ে এলেন একটি উপযুক্ত নাম নিয়ে। তিনি শাহীন নামটির প্রস্তাব দিলেন এবং তা সাথে সাথে গ্রহণযোগ্যতা পেল। “শাহীন” একটি উর্দু শব্দ যার অর্থ হচ্ছে ঈগল, যা বিমানবাহিনীর সাথে অত্যান্ত সামঞ্জস্যপূর্ণ। স্কুল পরিচালনার অর্থ যোগান ও ভবন নির্মাণের বিষয়ে বিভিন্ন পরিকল্পনা, পর্যালোচনা চলল। আর এই সব পরিকল্পনা নিবেদিত প্রাণ ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলাউল্লাহ যোগ্য নেতৃত্বে বাস্তবে রূপ নিল। যদিও প্রাথমিকভাবে স্কুলটি বিমানবাহিনীর কর্মকর্তা-কর্মচারীদের সন্তানদের জন্য প্রতিষ্ঠা করা হয়েছিল; পরবর্তীতে তা বেসামরিক বিভিন্ন শ্রেণি-পেশার সন্তানদের জন্যও চালু করা হয়। এস. এ. আহমেদ ছিলেন স্কুলের প্রথম অধ্যক্ষ। স্কুলটি মাত্র ৩৪জন শিক্ষার্থী নিয়ে যাত্রা শুরু করে। স্কুল ভবন হিসেবে প্রথমে স্কোয়াশ কোর্ট ও পরবর্তীতে সার্জেন্ট মেস, ক্যাম্প মসজিদ ও রাডার ভবনকে ব্যবহার করা হয়। সিভিল এভিয়েশনের সম্প্রচার কক্ষকে অধ্যক্ষের কার্যালয় হিসেবে ব্যবহারের সুবিধা দেয়া হয়। ইতিমধ্যে প্রতিরক্ষা মন্ত্রণালয় বর্তমান স্কুল ভবনের জমিটি স্কুল কর্তৃপক্ষের জন্য বরাদ্দ দেয়। এভাবেই ১ মার্চ ১৯৬০ সালের এক সকালে গ্রুপ ক্যাপ্টেন ভোগার এবং ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলউল্লাহ যে ছোট্ট স্বপ্ন দেখেছিলেন তা আজ এক মাইলফলকে রূপান্তরিত হয়েছে। স্বাধীনতা পরবর্তী সময়ে বাংলাদেশ বিমানবাহিনী স্কুলটিকে নতুনভাবে গড়ে তোলেন। এদিকে ধীরে ধীরে ছাত্র-ছাত্রীর সংখ্যা বাড়তে থাকে।১৯৯৪-৯৮ সালের মধ্যে দু’টি তিনতলা কলেজ ভবন নির্মিত হয়। ২০০২-০৫ সালে নির্মিত হয় কলেজ অডিটোরিয়াম শাহীন হল। তাছাড়া নিরবিচ্ছিন্ন বিদ্যুৎ এবং পানি সরবরাহ নিশ্চিত করার লক্ষ্যে কলেজের নিজস্ব জেনারেটর এবং গভীর নলকূপ স্থাপন করা হয়েছে। এসকল অর্জন সম্ভব হয়েছে বিমানবাহিনী কর্তৃপক্ষের সুনিপুণ পরিকল্পনা ও দূরদৃষ্টির জন্য। ১৯৬০ সাল থেকে অদ্যবধি প্রতিষ্ঠানের জন্য অধ্যক্ষবৃন্দ, উপাধ্যক্ষবৃন্দ, শিক্ষক-শিক্ষিকা ও কর্মকর্তা-কর্মচারিগণের অবদান, ত্যাগ ও সহযোগিতা স্কুলের ইতিহাসে চিরভাস্কর হয়ে থাকবে।</p>',

        ]);
        Page::updateOrCreate([
            'title'  => 'Governing Body',
            'slug' => 'governing-body',
            'image' => 'gal1.png',
            'content' => '<p>বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ২০০৬ শিক্ষাবর্ষে জাতীয় শিক্ষাক্রম ও টেক্সটবুক বোর্ডের শিক্ষানীতি অনুযায়ী বাংলা মাধ্যমের পাশাপাশি ইংরেজি মাধ্যম চালু করা হয়। দীর্ঘ পাঁচ দশকেরও বেশি সময় ধরে প্রতিষ্ঠানটি বহু প্রতিভার জন্ম দিয়েছে যাঁরা জাতীয় ও আন্তর্জাতিক পর্যায়ে স্বনামধন্য হয়েছেন। গ্রুপ ক্যাপ্টেন ভোগার ছিলেন তৎকালীন পাকিস্তান বিমানবাহিনীর ঘাঁটি অফিসার-ইন-কমান্ড এবং একইসাথে সিভিল এভিয়েশনের ভারপ্রাপ্ত কর্মকর্তা। সেই সময় পাকিস্তান বিমানবাহিনী, সেনাবহিনী, সিভিল এভিয়েশন এবং PIA(Pakistan International Airlines) এর সকল কর্মকর্তা-কর্মচারী ছিলেন পশ্চিম পাকিস্তানী ও উর্দু ভাষাভাষী। তাই ঢাকায় বিমানবাহিনীর কর্মকর্তা-কর্মচারীবৃন্দের সন্তানদের শিক্ষা সমস্যা দূর করার লক্ষ্যে ইংরেজি মাধ্যম স্কুলের প্রয়োজনীয়তা সকলেই অনুভব করলেন। ফ্লাইট লেফটেন্যান্ট (শিক্ষা পরিদপ্তর) এজেএম খলিল উল্লাহ, যিনি পরবর্তীতে ইংল্যান্ডের লিংকন’স ইন হতে ব্যারিস্টার-এট-ল ডিগ্রি অর্জন করে ব্যারিস্টার খলিল উল্লাহ নামে অধিক সমাদৃত হন; স্কুলের প্রতিষ্ঠাতা সভাপতি হিসেবে নিয়োগ পান। স্কুল প্রতিষ্ঠার এই কাজটি ছিল অত্যান্ত সাহসী পদক্ষেপ। এই পর্যায়ে স্কুলটির একটি সার্থক নাম নিয়ে বিপদে পড়তে হয়। অবশেষে সার্জেন্ট জাকারিয়া এগিয়ে এলেন একটি উপযুক্ত নাম নিয়ে। তিনি শাহীন নামটির প্রস্তাব দিলেন এবং তা সাথে সাথে গ্রহণযোগ্যতা পেল। “শাহীন” একটি উর্দু শব্দ যার অর্থ হচ্ছে ঈগল, যা বিমানবাহিনীর সাথে অত্যান্ত সামঞ্জস্যপূর্ণ। স্কুল পরিচালনার অর্থ যোগান ও ভবন নির্মাণের বিষয়ে বিভিন্ন পরিকল্পনা, পর্যালোচনা চলল। আর এই সব পরিকল্পনা নিবেদিত প্রাণ ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলাউল্লাহ যোগ্য নেতৃত্বে বাস্তবে রূপ নিল। যদিও প্রাথমিকভাবে স্কুলটি বিমানবাহিনীর কর্মকর্তা-কর্মচারীদের সন্তানদের জন্য প্রতিষ্ঠা করা হয়েছিল; পরবর্তীতে তা বেসামরিক বিভিন্ন শ্রেণি-পেশার সন্তানদের জন্যও চালু করা হয়। এস. এ. আহমেদ ছিলেন স্কুলের প্রথম অধ্যক্ষ। স্কুলটি মাত্র ৩৪জন শিক্ষার্থী নিয়ে যাত্রা শুরু করে। স্কুল ভবন হিসেবে প্রথমে স্কোয়াশ কোর্ট ও পরবর্তীতে সার্জেন্ট মেস, ক্যাম্প মসজিদ ও রাডার ভবনকে ব্যবহার করা হয়। সিভিল এভিয়েশনের সম্প্রচার কক্ষকে অধ্যক্ষের কার্যালয় হিসেবে ব্যবহারের সুবিধা দেয়া হয়। ইতিমধ্যে প্রতিরক্ষা মন্ত্রণালয় বর্তমান স্কুল ভবনের জমিটি স্কুল কর্তৃপক্ষের জন্য বরাদ্দ দেয়। এভাবেই ১ মার্চ ১৯৬০ সালের এক সকালে গ্রুপ ক্যাপ্টেন ভোগার এবং ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলউল্লাহ যে ছোট্ট স্বপ্ন দেখেছিলেন তা আজ এক মাইলফলকে রূপান্তরিত হয়েছে। স্বাধীনতা পরবর্তী সময়ে বাংলাদেশ বিমানবাহিনী স্কুলটিকে নতুনভাবে গড়ে তোলেন। এদিকে ধীরে ধীরে ছাত্র-ছাত্রীর সংখ্যা বাড়তে থাকে।১৯৯৪-৯৮ সালের মধ্যে দু’টি তিনতলা কলেজ ভবন নির্মিত হয়। ২০০২-০৫ সালে নির্মিত হয় কলেজ অডিটোরিয়াম শাহীন হল। তাছাড়া নিরবিচ্ছিন্ন বিদ্যুৎ এবং পানি সরবরাহ নিশ্চিত করার লক্ষ্যে কলেজের নিজস্ব জেনারেটর এবং গভীর নলকূপ স্থাপন করা হয়েছে। এসকল অর্জন সম্ভব হয়েছে বিমানবাহিনী কর্তৃপক্ষের সুনিপুণ পরিকল্পনা ও দূরদৃষ্টির জন্য। ১৯৬০ সাল থেকে অদ্যবধি প্রতিষ্ঠানের জন্য অধ্যক্ষবৃন্দ, উপাধ্যক্ষবৃন্দ, শিক্ষক-শিক্ষিকা ও কর্মকর্তা-কর্মচারিগণের অবদান, ত্যাগ ও সহযোগিতা স্কুলের ইতিহাসে চিরভাস্কর হয়ে থাকবে।</p>',

        ]);
        Page::updateOrCreate([
            'title'  => 'At A Glance',
            'slug' => 'at-a-glance',
            'image' => 'gal1.png',
            'content' => '<ul><li>প্রতিষ্ঠানের নাম: বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka)</li><li>প্রতিষ্ঠা: ১ মার্চ, ১৯৬০ (ইংরেজি মাধ্যম স্কুল হিসেবে)</li><li>শিক্ষা বোর্ডের স্বীকৃতি: ৩১ অক্টোবর, ১৯৬২</li><li>ইংরেজির পাশাপাশি বাংলা মাধ্যম চালু: ১ জানুয়ারি ১৯৬৭</li><li>শুধু বাংলা মাধ্যম চালু: ১ জানুয়ারি ১৯৭১</li><li>উচ্চমাধ্যমিক কলেজে উন্নীত: ১ জুলাই ১৯৭৭</li><li>বাংলার পাশাপাশি ইংরেজি মাধ্যম চালু: ১ জানুয়ারি ২০০৬</li><li>দ্বিতীয় শিফট চালু (১ম শ্রেণি পর্যন্ত): ১ জানুয়ারি ২০১৫</li><li>ডিগ্রি কলেজে উন্নীত: ১৯৯০-৯১ শিক্ষাবর্ষ</li><li>ডিগ্রি অবলুপ্ত: ২০০৬-২০০৭</li><li>স্কুলের স্বীকৃতি: ১ জুলাই ১৯৬২</li><li>কলেজের স্বীকৃতি: ১ জুলাই ১৯৭৮</li><li>স্কুল কোড: ১২৭২</li><li>কলেজ কোড: ১০৫১</li><li>EIIN: 500765</li></ul>',

        ]);

        $this->menuDataImport();

      
    }






    public function menuDataImport()
    {
        $frontendMenu = Menu::create([
            'name' => 'home-menu',
            'description' => 'This is Home Menu.',
            'deleteable' => false
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order' => 1,
            'title' => 'Home',
            'url'   => '/'
        ]);

        $aboutMenu = $frontendMenu->menuItems()->updateOrcreate([
            'order' => 1,
            'title' => 'About Us',
        ]);

        $administrationMenu = $frontendMenu->menuItems()->updateOrcreate([
            'order' => 1,
            'title' => 'Administration',
        ]);

        $academicMenu = $frontendMenu->menuItems()->updateOrcreate([
            'order' => 1,
            'title' => 'Academic ',
        ]);

        $downloadMenu = $frontendMenu->menuItems()->updateOrcreate([
            'order' => 1,
            'title' => 'Download',
        ]);

        $coCurriculamMenu = $frontendMenu->menuItems()->updateOrcreate([
            'order' => 1,
            'title' => 'Co-Curriculam',
        ]);
        $frontendMenu->menuItems()->updateOrcreate([
            'order' => 1,
            'title' => 'Gallery',
            'url'   => '/page/gallery'
        ]);
        $frontendMenu->menuItems()->updateOrcreate([
            'order' => 1,
            'title' => 'Contact Us',
            'url'   => '/page/contact-us'
        ]);


        // about subpage start
        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 4,
            'parent_id' => $aboutMenu->id,
            'title'     => 'News & Event',
            'url'       => '/page/NewsEvent',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 5,
            'parent_id' => $aboutMenu->id,
            'title'     => 'Achievement',
            'url'       => '/page/Achievement',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 6,
            'parent_id' => $aboutMenu->id,
            'title'     => 'Infrastructure',
            'url'       => '/page/Infrastructure',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 7,
            'parent_id' => $aboutMenu->id,
            'title'     => 'Why Study',
            'url'       => '/page/whystudy',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 8,
            'parent_id' => $aboutMenu->id,
            'title'     => 'History',
            'url'       => '/page/history',
            'target'    => '_self'
        ]);
        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 9,
            'parent_id' => $aboutMenu->id,
            'title'     => 'At a Glance',
            'url'       => 'page/at_a_glance',
            'target'    => '_self'
        ]);

        //about subpage ends

        //administration subpage start

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 1,
            'parent_id' => $administrationMenu->id,
            'title'     => 'Governing Body',
            'url'       => '/page/governing-body',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 2,
            'parent_id' => $administrationMenu->id,
            'title'     => 'Chairman Message',
            'url'       => '/page/chairman-message',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 3,
            'parent_id' => $administrationMenu->id,
            'title'     => 'Principal Message',
            'url'       => '/page/principal-message',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 4,
            'parent_id' => $administrationMenu->id,
            'title'     => 'Teachers',
            'url'       => '/page/teachers',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 5,
            'parent_id' => $administrationMenu->id,
            'title'     => 'Staff',
            'url'       => '/page/staff',
            'target'    => '_self'
        ]);

        //administration subpage ends


        //academic subpage start

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 1,
            'parent_id' => $academicMenu->id,
            'title'     => 'Students List',
            'url'       => '/page/students-list',
            'target'    => '_self'
        ]);
        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 2,
            'parent_id' => $academicMenu->id,
            'title'     => 'Merit Student',
            'url'       => 'page/merit-students-list',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 3,
            'parent_id' => $academicMenu->id,
            'title'     => 'Class Routine',
            'url'       => '/page/class-routine',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 4,
            'parent_id' => $academicMenu->id,
            'title'     => 'Exam Routine',
            'url'       => '/page/exam-routine',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 5,
            'parent_id' => $academicMenu->id,
            'title'     => 'Syllabus & Booklist',
            'url'       => '/page/syllabus-booklist',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 6,
            'parent_id' => $academicMenu->id,
            'title'     => 'Result',
            'url'       => '/page/result',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 7,
            'parent_id' => $academicMenu->id,
            'title'     => 'Notice',
            'url'       => '/page/notice',
            'target'    => '_self'
        ]);

        //academic subpage ends


        //Download subpage start

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 1,
            'parent_id' => $downloadMenu->id,
            'title'     => 'Digital Content',
            'url'       => '/page/digital-content',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 2,
            'parent_id' => $downloadMenu->id,
            'title'     => 'Hand Book',
            'url'       => '/page/hand-book',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 3,
            'parent_id' => $downloadMenu->id,
            'title'     => 'Home Work',
            'url'       => '/page/home-work',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 4,
            'parent_id' => $downloadMenu->id,
            'title'     => 'Class Notice',
            'url'       => '/page/class-notice',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 5,
            'parent_id' => $downloadMenu->id,
            'title'     => 'Other Downloads',
            'url'       => '/page/other-downloads',
            'target'    => '_self'
        ]);

        //Download subpage ends


        //Co-Curriculam subpage start

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 1,
            'parent_id' => $coCurriculamMenu->id,
            'title'     => 'Sports',
            'url'       => '/page/sports',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 2,
            'parent_id' => $coCurriculamMenu->id,
            'title'     => 'Tours',
            'url'       => '/page/tours',
            'target'    => '_self'
        ]);

        $frontendMenu->menuItems()->updateOrcreate([
            'order'     => 3,
            'parent_id' => $coCurriculamMenu->id,
            'title'     => 'Scout',
            'url'       => '/page/scout',
            'target'    => '_self'
        ]);
    }

    public function academicDataImport()
    {
        $year = date('Y');
        //Create Session
        Session::create([
            'uuid'         => (string) Str::uuid(),
            'title'        => $year,
            'is_active' => 1
        ]);
        Session::create([
            'uuid'         => (string) Str::uuid(),
            'title'        => intval($year) + 1,
            'is_active' => 1
        ]);

        //create Classes
        $session = \App\Models\Session::first();
        $classNames = ['Six', 'Seven', 'Eight'];
        $classCode = ['06', '07', '08'];

        foreach ($classNames as $key => $className) {
            $class = InsClass::create([
                'session_id' => $session->id,
                'name'  => $className,
                'code'  => $classCode[$key],
                'status' => 1
            ]);
            //create Shift
            $shift = Shift::create([
                'ins_class_id' => $class->id,
                'name'         => 'Day'
            ]);
            //create Section
            $section = Section::create([
                'institute_id'  => Helper::getInstituteId(),
                'institute_branch_id'  => Helper::getBranchId(),
                'ins_class_id'  => $class->id,
                'shift_id'      => $shift->id,
                'name'          => 'A'
            ]);
            //create Category
            $category = Category::create([
                'ins_class_id'  => $class->id,
                'shift_id'      => $shift->id,
                'section_id'    => $section->id,
                'name'          => 'BN Version'
            ]);
            //create Group
            $group = Group::create([
                'ins_class_id'  => $class->id,
                'shift_id'      => $shift->id,
                'section_id'    => $section->id,
                'name'          => 'Common'
            ]);

            //create Student
            $students  = [
                "Sajid Hasan", "Munna Hasan", "Nafiz Ahmed", "Emon Hasan", "Zakir Hasan",
                "Ismail Shekh", "Hasan Ahmed", "Ishrak Khan", "Peyal Hasan", "Afif Mozumder"
            ];

            if (env('APP_ENV') === 'local') {
                for ($x = 0; $x <= 7; $x++) {
                    Student::create([
                        'id_no'         => Helper::studentIdGenerate($session->id, $class->id),
                        'name'          => $students[rand(0, 9)],
                        'finger_id'     => rand(1000, 10000),
                        'session_id'    => $session->id,
                        'class_id'      => $class->id,
                        'shift_id'      => $shift->id,
                        'section_id'    => $section->id,
                        'category_id'   => $category->id,
                        'group_id'      => $group->id,
                        'religion'      => 'Islam',
                        'mobile_number' => '01683813854',
                        'father_name'   => 'Rafiq Khan',
                        'mother_name'   => 'Nilima Hasan',
                        'roll_no'       => '10' . $key,
                        'gender'        => rand(0, 1) ? 'male' : 'female'
                    ]);
                }
            }else{
                Student::create([
                    'id_no'         => Helper::studentIdGenerate($session->id, $class->id),
                    'name'          => $students[rand(0, 9)],
                    'finger_id'     => rand(1000, 10000),
                    'session_id'    => $session->id,
                    'class_id'      => $class->id,
                    'shift_id'      => $shift->id,
                    'section_id'    => $section->id,
                    'category_id'   => $category->id,
                    'group_id'      => $group->id,
                    'religion'      => 'Islam',
                    'mobile_number' => '01683813854',
                    'father_name'   => 'Rafiq Khan',
                    'mother_name'   => 'Nilima Hasan',
                    'roll_no'       => '10' . $key,
                    'gender'        => rand(0, 1) ? 'male' : 'female'
                ]);
            }


        }
        $this->createSubjects();

        //period Seeder
        $periods = ['1st Period','2nd Period','3rd Period'];

        foreach($periods as $period){
            Period::create([
                'name' => $period
            ]);
        }
    }

    public function teacherDataImport()
    {
        //create Designation
        $designations = ['Teacher', 'Staff', 'Chairman', 'Guardian Representative', 'Member Secretary', 'Committee'];

        foreach ($designations as $designation) {
            Designation::create([
                'title' => $designation,
            ]);
        }

        //create Branch
        Branch::create([
            'title' => "Dhaka",
        ]);
        Branch::create([
            'title' => "Cumilla",
        ]);
        Branch::create([
            'title' => "Rajshahi",
        ]);

        //create Teacher
        Teacher::create([
            'name'           => "Hasan Alam",
            'type'           => "teacher",
            'finger_id'      => rand(1000, 5000),
            'gender'         => rand(0, 1) ? 'male' : 'female',
            'id_no'          =>  rand(1000, 5000),
            'mobile_number'  => "01683813854",
            'designation_id' => Designation::first()->id,
        ]);
    }

    public function examDataImport()
    {
        //create Exam
        $exams = ["1st Semister", "2nd Semister", "3rd Semister"];
        $session = Session::first();

        foreach ($exams as $exam) {
            Exam::create([
                'session_id' => $session->id,
                'name'       => $exam,
                'start_date' => date("Y-m-d"),
                'end_date'   => date("Y-m-d"),
            ]);
        }

        //create Short Code
        $types = ["MCQ", "Subjective", "CL"];

        foreach ($types as $type) {
            SubMarksDistType::create([
                'title' => $type
            ]);
        }
    }

    public function accountsDataImport()
    {
        //create Account
        Account::create([
            'name' => "Cash"
        ]);
        Account::create([
            'name' => "Bank"
        ]);
        //create Fees Type
        FeesType::create([
            'type' => 'Admission Fees',
        ]);
        FeesType::create([
            'type' => 'Regular Fees',
        ]);
        FeesType::create([
            'type' => 'Exam Fees',
        ]);
        FeesType::create([
            'type' => 'Other Fees',
        ]);
    }
    public function createSubjects()
    {
        SubjectType::create([
            'name' => 'common',
            'is_common' => 1,
        ]);

        SubjectType::create([
            'name' => 'irregular',
        ]);

        SubjectType::create([
            'name' => 'optional',
        ]);
        $data = ["Bangla (101)", "English (107)", "Mathmatics (109)", "Religion &Moral Education (111)", "General Science (127)", "BD & Glob Studies (150)", "HigherMath (126)", "Finance & Banking (152)", "Accounting (146)", "Business Ent (143)", "Geography (110)", "Civic and Citizenship (140)", "Civic 2nd (140)", "Islamic History 1st (01)", "ICT (154)", "Physical Education (147)", "Arts & Crafts (148)", "Work and Life Education (155)", "Agriculture Studies (134)", "Bangla 1st (101)", "Economics (141)", "Physics 1st (178)", "Physics 2nd (189)", "Chemistry 1st (176)", "Chemistry 2nd (177)", "Biology 1st (178)", "Social Work 2nd (272)", "Accounting (253)", "Bangla 2nd (102)", "English 1st (107)", "English 2nd (108)", "Physics  (136)", "Chemistry (137)", "Biology  (138)", "Biology 2nd (179)", "Higher Math 1st (265)", "Higher Math 2nd (206)", "Economics 1st (141)", "Economics 2nd (141)", "Civic 1st (140)", "Business Entp 2nd (0)", "Agriculture Education 1st (238)", "Islamic History 1st (01)", "Islamic History 2nd (0)", "Logic 1st (121)", "Logic 2nd (122)", "Social Work 1st (271)", "Phychology 2nd (124)", "History 1st (304)", "History 2nd (305)", "Islamic History and Culture 1st(267)", "Islamic History and Culture 2nd(268)", "Civics and Good goernance 1st (269)", "Management 1st (0)", "Management 2nd (0)", "Islamic H&C 1st(0)", "Islamic H&C 2nd(0)", "Civics and Good goernance 1st (0)", "Civics and Good goernance 2nd (0)", "Accounting  1st(253)", "Accounting 2nd (254)", "Finance 1st (0)", "Finance 2nd (0)", "Business Ent 1st (0)", "Civics and Good goernance 2nd (270)", "Economy 1st (109)", "Economy 2nd (110)", "Soiology 1st (117)", "Soiology 2nd (118)", "Social Science 1st (117)", "Agriculture 1st (0)", "Agriculture 2nd (0)", "Math (00)", "Drawing (00)", "G Knowledge & Drw (00)", "Arabic (00)", "Agriculture Education 1st (239)", "Agriculture Education 2nd (240)", "Geography 1st (125)", "Geography 2nd (126)", "Phychology 1st (123)", "Social Science 2nd (118)", "Islamic Study 1st (249)", "Islamic Study 2nd (250)", "Finance an & Ins 1st (292)", "Finance an & Ins 2nd (293)", "GK & Oral Test (00)", "Religion (00)"];

        $subjects = [];
        foreach ($data as $subject) {
            $subjectCode = explode(')', (explode('(', $subject)[1]))[0];
            $subjectName = $s = explode("(", $subject);;

            Subject::create([
                'sub_name' => $subjectName[0],
                'sub_code' => $subjectCode
            ]);
        }
    }


    public function dataCountByModel($model)
    {
        return $model::count();
    }

    public function countCategory()
    {
        $classes = InsClass::all();
        $catCount = 0;
        foreach ($classes as $class) {
            if ($class->categories) {
                $catCount += $class->categories->count();
            }
        }
        return $catCount;
    }

    public function countGroup()
    {
        $classes = InsClass::all();
        $catCount = 0;
        foreach ($classes as $class) {
            if ($class->groups) {
                $catCount += $class->groups->count();
            }
        }
        return $catCount;
    }
}
